hiperiondev/esp32idf_APRS/main/app_config.c
void app_config_unlock(void) {
    SemaphoreHandle_t m = __atomic_load_n(&s_data_mutex, __ATOMIC_ACQUIRE);
    if (m)
        xSemaphoreGive(m);
}

static void set_str(char *dst, size_t sz, const char *val) {
    if (!val) {
        dst[0] = 0;
        return;
    }
    strncpy(dst, val, sz - 1);
    dst[sz - 1] = 0;
}

// Loads a stored free-text field the same way set_str() loads every other
// stored string, except that the cut is walked back to a whole character
// instead of a whole byte. Reserved for the handful of fields that are
// 8-bit-clean and repeated on the air unchanged (comment and status text,
// per aprs.org/aprs12/utf-8.txt) - every other set_str() call is a coded or
// structured field (callsign, hostname, filter spec, ...) that is
// effectively ASCII, where a byte cut and a character cut always land in the
// same place.
static void set_str_utf8(char *dst, size_t sz, const char *val) {
    str_copy_utf8_safe(val, dst, sz);
}

void app_config_set_defaults(app_config_t *c) {
    memset(c, 0, sizeof(*c));

    c->synctime = true;
    c->cpuFreq = 240;
    c->timezone_idx = 0; // UTC

    set_str(c->my_callsign, sizeof(c->my_callsign), "NOCALL");
    // Coordinates start at 0/0 and are transmitted as they stand. APRS has no
    // "position unknown" form, so a station that beacons before the operator
    // sets these puts a real position in the Gulf of Guinea on the air; the
    // placeholder callsign above is what keeps that from being mistaken for a
    // licensed station.
    c->my_lat = 0.0f;
    c->my_lon = 0.0f;
    c->my_alt = 0.0f;

    c->my_phg_power = 1;
    c->my_phg_gain = 6.0f;
    c->my_phg_height = 10;
    c->my_phg_dir = 0;

    c->pos_ambiguity = 0;
    c->status_grid_en = false;
    c->status_timestamp_en = false;
    c->status_beam_deg = STATUS_BEAM_DEG_OFF;
    c->status_erp_watts = 0;
    c->my_no_archive = false;
    c->pos_dao_en = false;

    c->wifi_mode = 2; // AP_STA equivalent default (matches original shipping as AP)
    c->wifi_power = WIFI_TX_POWER_DBM_DEFAULT;
    for (int i = 0; i < WIFI_STA_NUM; i++) {
        c->wifi_sta[i].enable = false;
        set_str(c->wifi_sta[i].wifi_ssid, sizeof(c->wifi_sta[i].wifi_ssid), "WIFI_AP");
        set_str(c->wifi_sta[i].wifi_pass, sizeof(c->wifi_sta[i].wifi_pass), "");
    }
    c->wifi_ap_ch = WIFI_AP_CH_DEFAULT;
    set_str(c->wifi_ap_ssid, sizeof(c->wifi_ap_ssid), "esp32idf_APRS");
    set_str(c->wifi_ap_pass, sizeof(c->wifi_ap_pass), "esp32idf_APRS");

    // IGATE
    c->igate_en = true;
    c->rf2inet = true;
    c->inet2rf = false;
    c->igate_loc2rf = false;
    c->igate_loc2inet = true;
    c->aprs_ssid = 10;
    set_str(c->aprs_mycall, sizeof(c->aprs_mycall), "NOCALL");
    set_str(c->aprs_passcode, sizeof(c->aprs_passcode), "-1");
    // Slot 0 keeps the original single-server default; the remaining slots
    // start disabled so an upgraded device connects exactly as before until
    // the operator opts into the extra failover servers.
    c->aprs_server[0].enable = true;
    set_str(c->aprs_server[0].host, sizeof(c->aprs_server[0].host), "aprs.dprns.com");
    c->aprs_server[0].port = APRS_PORT_DEFAULT;
    for (int i = 1; i < APRS_SERVER_NUM; i++) {
        c->aprs_server[i].enable = false;
        set_str(c->aprs_server[i].host, sizeof(c->aprs_server[i].host), "aprs.dprns.com");
        c->aprs_server[i].port = APRS_PORT_DEFAULT;
    }
    set_str(c->aprs_filter, sizeof(c->aprs_filter), "");
    c->igate_bcn = true;
    c->igate_lat = 0.000f;
    c->igate_lon = 0.000f;
    c->igate_alt = 0;
    c->igate_interval = 30;
    set_str(c->igate_symbol, sizeof(c->igate_symbol), "N&");
    // Preset-slot mask over path[0..3], not a service mask: bit 0 is the
    // only slot that ships with a path string.
    c->igate_path = PATH_PRESET_MASK_DEFAULT;
    set_str(c->igate_comment, sizeof(c->igate_comment), "esp32idf_APRS IGate");
    c->igate_sts_interval = 0;
    c->igate_compress = false;
    c->igate_phg_enable = false;
    c->igate_phg_use_station = false;
    c->igate_phg_power = 1;
    c->igate_phg_gain = 6.0f;
    c->igate_phg_height = 10;
    c->igate_phg_dir = 0;
    c->igate_ext_type = APRS_EXT_PHG;
    c->igate_range_miles = 0;
    c->igate_dfs_strength = 0;
    c->igate_freq_mhz = 0.0f;
    c->igate_tone_tenths = 0;
    c->igate_duplex = 0;
    c->igate_offset_khz = 0;
    c->rf2inetFilter = IGATE_FILT_MESSAGE | IGATE_FILT_STATUS | IGATE_FILT_TELEMETRY | IGATE_FILT_WEATHER | IGATE_FILT_OBJECT | IGATE_FILT_ITEM |
                       IGATE_FILT_BUOY | IGATE_FILT_POSITION | IGATE_FILT_OTHER;
    c->inet2rfFilter = IGATE_FILT_MESSAGE;
    c->rf2inet_budlist_mode = BUDLIST_OFF;
    c->inet2rf_budlist_mode = BUDLIST_OFF;
    for (int i = 0; i < IGATE_BUDLIST_MAX; i++)
        set_str(c->budlist[i], sizeof(c->budlist[i]), "");

    // Satellite/ISS digipeater gate-call list: the same 6 calls this firmware
    // always used before this list became web-configurable. Remaining slots
    // (if IGATE_SATGATE_MAX ever grows past 6) default to empty/unused.
    {
        static const char *satGateDefaults[] = { "RS0ISS", "YBOX", "YBSAT", "PSAT", "W3ADO", "BJ1SI" };
        for (int i = 0; i < IGATE_SATGATE_MAX; i++)
            set_str(c->satgate[i], sizeof(c->satgate[i]), (i < (int)(sizeof(satGateDefaults) / sizeof(satGateDefaults[0]))) ? satGateDefaults[i] : "");
    }
    c->dup_cache_size = DUP_CACHE_SIZE_DEFAULT;
    c->dup_cache_timeout_ms = DUP_CACHE_TIMEOUT_MS_DEFAULT;

    c->rf2inet_range_en = false;
    c->rf2inet_range_km = 0.0f;
    c->rf2inet_prefix_en = false;
    set_str(c->rf2inet_prefixes, sizeof(c->rf2inet_prefixes), "");
    c->inet2rf_3rdparty_unwrap_en = false;
    c->igate_msg_gate_en = true;
    c->igate_local_window_sec = IGATE_LOCAL_WINDOW_SEC_DEFAULT;

    // DIGI
    c->digi_en = false;
    c->digi_ssid = 1;
    set_str(c->digi_mycall, sizeof(c->digi_mycall), "NOCALL");
    c->digi_path = PATH_PRESET_MASK_DEFAULT; // preset-slot mask over path[0..3], not a service mask
    c->digi_bcn = true;
    c->digi_compress = false;
    c->digi_interval = 30;
    set_str(c->digi_symbol, sizeof(c->digi_symbol), "N&");
    set_str(c->digi_comment, sizeof(c->digi_comment), "esp32idf_APRS Digi");
    c->digi_freq_mhz = 0.0f;
    c->digi_tone_tenths = 0;
    c->digi_duplex = 0;
    c->digi_offset_khz = 0;

    // Factory alias table: the New n-N Paradigm's two standard aliases get a
    // row each so their hop limits can differ, and a wildcard row catches the
    // rest of the WIDEn family and traps it down to two hops. Every row traces
    // (inserts this station's callsign), which is what makes each hop of a
    // repeated path identifiable. The fourth row is free for a regional
    // SSn-N alias.
    {
        static const digi_alias_t aliasDefaults[] = {
            { "WIDE1", 1, DIGI_ALIAS_TRACE },
            { "WIDE2", 2, DIGI_ALIAS_TRACE },
            { "WIDE#", 2, DIGI_ALIAS_TRACE },
            { "", 1, DIGI_ALIAS_OFF },
        };
        for (int i = 0; i < DIGI_ALIAS_MAX; i++) {
            if (i < (int)(sizeof(aliasDefaults) / sizeof(aliasDefaults[0]))) {
                c->digi_alias[i] = aliasDefaults[i];
            } else {
                set_str(c->digi_alias[i].alias, sizeof(c->digi_alias[i].alias), "");
                c->digi_alias[i].max_n = 1;
                c->digi_alias[i].mode = DIGI_ALIAS_OFF;
            }
        }
    }
    c->digi_fillin_only = false;
    c->digi_trap_n_clamp = true;
    // Routing on the destination SSID alone is pre-New-N behaviour that
    // bypasses the alias table entirely, so it stays off until an operator who
    // still has a legacy neighbour asks for it.
    c->digi_dest_ssid_en = false;
    // Scanning past the first unused address changes which stations this
    // digipeater answers for, so it is opt-in: a station that has not been
    // asked to serve an explicit route behaves exactly as the alias table says.
    c->digi_preempt = DIGI_PREEMPT_OFF;

