hiperiondev/esp32idf_APRS/main/app_config.c
            cJSON *n = an ? cJSON_GetArrayItem(an, i) : NULL;
            c->digi_alias[i].max_n = (uint8_t)((n && cJSON_IsNumber(n)) ? n->valuedouble : def.digi_alias[i].max_n);
            if (c->digi_alias[i].max_n < 1 || c->digi_alias[i].max_n > DIGI_ALIAS_MAX_N) {
                ESP_LOGW(TAG, "digiAliasMaxN[%d] %u out of range, clamped to 1..%d", i, (unsigned)c->digi_alias[i].max_n, DIGI_ALIAS_MAX_N);
                c->digi_alias[i].max_n = (c->digi_alias[i].max_n < 1) ? 1 : DIGI_ALIAS_MAX_N;
            }

            cJSON *m = am ? cJSON_GetArrayItem(am, i) : NULL;
            c->digi_alias[i].mode = (uint8_t)((m && cJSON_IsNumber(m)) ? m->valuedouble : def.digi_alias[i].mode);
            if (c->digi_alias[i].mode != DIGI_ALIAS_OFF && c->digi_alias[i].mode != DIGI_ALIAS_TRACE && c->digi_alias[i].mode != DIGI_ALIAS_FLOOD) {
                ESP_LOGW(TAG, "digiAliasMode[%d] %u unknown, row disabled", i, (unsigned)c->digi_alias[i].mode);
                c->digi_alias[i].mode = DIGI_ALIAS_OFF;
            }
        }
    }
    c->digi_fillin_only = jget_bool(d, "digiFillinOnly", def.digi_fillin_only);
    c->digi_trap_n_clamp = jget_bool(d, "digiTrapNClamp", def.digi_trap_n_clamp);
    c->digi_dest_ssid_en = jget_bool(d, "digiDestSsidEn", def.digi_dest_ssid_en);
    c->digi_preempt = (uint8_t)jget_num(d, "digiPreempt", def.digi_preempt);
    if (c->digi_preempt != DIGI_PREEMPT_OFF && c->digi_preempt != DIGI_PREEMPT_DROP && c->digi_preempt != DIGI_PREEMPT_MARK) {
        ESP_LOGW(TAG, "digiPreempt %u unknown, preemptive digipeating disabled", (unsigned)c->digi_preempt);
        c->digi_preempt = DIGI_PREEMPT_OFF;
    }
    c->digi_bcn = jget_bool(d, "digiBcn", def.digi_bcn);
    c->digi_compress = jget_bool(d, "digiCompress", def.digi_compress);
    c->digi_alt = (float)jget_num(d, "digiAlt", def.digi_alt);
    c->digi_lat = (float)jget_num(d, "digiLAT", def.digi_lat);
    c->digi_lon = (float)jget_num(d, "digiLON", def.digi_lon);
    c->digi_interval = (uint16_t)jget_num(d, "digiINV", def.digi_interval);
    set_str(c->digi_symbol, sizeof(c->digi_symbol), jget_str(d, "digiSymbol", def.digi_symbol));
    clamp_symbol(c->digi_symbol, "digiSymbol");
    set_str_utf8(c->digi_comment, sizeof(c->digi_comment), jget_str(d, "digiComment", def.digi_comment));
    c->digi_sts_interval = (uint16_t)jget_num(d, "digiSTSIntv", def.digi_sts_interval);
    set_str_utf8(c->digi_status, sizeof(c->digi_status), jget_str(d, "digiStatus", def.digi_status));
    c->digi_freq_mhz = (float)jget_num(d, "digiFreqMHz", def.digi_freq_mhz);
    c->digi_tone_tenths = (uint16_t)jget_num(d, "digiFreqTone", def.digi_tone_tenths);
    c->digi_duplex = (int8_t)jget_num(d, "digiFreqDup", def.digi_duplex);
    c->digi_offset_khz = (uint16_t)jget_num(d, "digiFreqOff", def.digi_offset_khz);

    c->trk_en = jget_bool(d, "trkEn", def.trk_en);
    c->trk_loc2rf = jget_bool(d, "trkPos2rf", def.trk_loc2rf);
    c->trk_loc2inet = jget_bool(d, "trkPos2inet", def.trk_loc2inet);
    c->trk_timestamp = jget_bool(d, "trkTime", def.trk_timestamp);
    c->trk_ssid = (uint8_t)jget_num(d, "trkSSID", def.trk_ssid);
    set_str(c->trk_mycall, sizeof(c->trk_mycall), jget_str(d, "trkMycall", def.trk_mycall));
    c->trk_use_station = jget_bool(d, "trkUseStation", def.trk_use_station);
    c->trk_path = (uint8_t)jget_num(d, "trkPath", def.trk_path);
    c->trk_lat = (float)jget_num(d, "trkLAT", def.trk_lat);
    c->trk_lon = (float)jget_num(d, "trkLON", def.trk_lon);
    c->trk_alt = (float)jget_num(d, "trkALT", def.trk_alt);
    c->trk_interval = (uint16_t)jget_num(d, "trkINV", def.trk_interval);
    c->trk_compress = jget_bool(d, "trkCompress", def.trk_compress);
    c->trk_phg_enable = jget_bool(d, "trkPHG", def.trk_phg_enable);
    c->trk_mice = jget_bool(d, "trkMice", def.trk_mice);
    c->trk_mice_msg = (uint8_t)jget_num(d, "trkMiceMsg", def.trk_mice_msg);
    // Same two-layer clamp every other bounded field uses: the form handler
    // bounds what the operator can send, and this bounds what a hand-edited
    // or older config.json can carry into the beacon builder.
    if (c->trk_mice_msg > MICE_POS_COMMENT_MAX) {
        ESP_LOGW(TAG, "trkMiceMsg %u out of range (0-%d) - using %d", (unsigned)c->trk_mice_msg, MICE_POS_COMMENT_MAX, MICE_POS_COMMENT_DEFAULT);
        c->trk_mice_msg = MICE_POS_COMMENT_DEFAULT;
    }
    c->trk_altitude = jget_bool(d, "trkOptAlt", def.trk_altitude);
    set_str(c->trk_symbol, sizeof(c->trk_symbol), jget_str(d, "trkSymbol", def.trk_symbol));
    clamp_symbol(c->trk_symbol, "trkSymbol");
    set_str_utf8(c->trk_comment, sizeof(c->trk_comment), jget_str(d, "trkComment", def.trk_comment));
    c->trk_sts_interval = (uint16_t)jget_num(d, "trkSTSIntv", def.trk_sts_interval);
    set_str_utf8(c->trk_status, sizeof(c->trk_status), jget_str(d, "trkStatus", def.trk_status));
    c->trk_freq_mhz = (float)jget_num(d, "trkFreqMHz", def.trk_freq_mhz);
    c->trk_tone_tenths = (uint16_t)jget_num(d, "trkFreqTone", def.trk_tone_tenths);
    c->trk_duplex = (int8_t)jget_num(d, "trkFreqDup", def.trk_duplex);
    c->trk_offset_khz = (uint16_t)jget_num(d, "trkFreqOff", def.trk_offset_khz);

    c->wx_en = jget_bool(d, "wxEn", def.wx_en);
    c->wx_2rf = jget_bool(d, "wxTx2rf", def.wx_2rf);
    c->wx_2inet = jget_bool(d, "wxTx2inet", def.wx_2inet);
    c->wx_timestamp = jget_bool(d, "wxTime", def.wx_timestamp);
    c->wx_ssid = (uint8_t)jget_num(d, "wxSSID", def.wx_ssid);
    set_str(c->wx_mycall, sizeof(c->wx_mycall), jget_str(d, "wxMycall", def.wx_mycall));
    c->wx_use_station = jget_bool(d, "wxUseStation", def.wx_use_station);
    c->wx_path = (uint8_t)jget_num(d, "wxPath", def.wx_path);
    c->wx_lat = (float)jget_num(d, "wxLAT", def.wx_lat);
    c->wx_lon = (float)jget_num(d, "wxLON", def.wx_lon);
    c->wx_interval = (uint16_t)jget_num(d, "wxInv", def.wx_interval);
    set_str(c->wx_object, sizeof(c->wx_object), jget_str(d, "wxObject", def.wx_object));
    set_str_utf8(c->wx_comment, sizeof(c->wx_comment), jget_str(d, "wxComment", def.wx_comment));
    {
        cJSON *a1 = cJSON_GetObjectItemCaseSensitive(d, "wxSenEn"), *a2 = cJSON_GetObjectItemCaseSensitive(d, "wxSenAvg"),
              *a3 = cJSON_GetObjectItemCaseSensitive(d, "wxSenCH");
        for (int i = 0; i < WX_SENSOR_NUM; i++) {
            cJSON *v;
            if (a1 && (v = cJSON_GetArrayItem(a1, i)))
                c->wx_sensor_enable[i] = cJSON_IsTrue(v);
            if (a2 && (v = cJSON_GetArrayItem(a2, i)))
                c->wx_sensor_avg[i] = cJSON_IsTrue(v);
            if (a3 && (v = cJSON_GetArrayItem(a3, i))) {
                if (cJSON_IsString(v)) {
                    // Driver name (see the writer above): resolve it against
                    // the registry this image actually built. A name that is
                    // no longer registered leaves the field unmapped and says
                    // so, rather than aiming it at whatever sensor now sits at
                    // that position.
                    c->wx_sensor_ch[i] = sensors_local_channel_from_name(v->valuestring);
                    if (c->wx_sensor_ch[i] == SENSOR_LOCAL_CH_NONE && v->valuestring != NULL && v->valuestring[0] != 0)
                        ESP_LOGW(TAG, "WX field %d: sensor '%s' is not registered, left unmapped", i, v->valuestring);
                } else if (cJSON_IsNumber(v)) {
                    // A config.json that predates name-based mappings: the
                    // number is a registry position, and it is only meaningful
                    // if the registry still reaches that far.
                    unsigned idx = (unsigned)v->valuedouble;
                    if (idx != SENSOR_LOCAL_CH_NONE && idx >= sensors_local_count()) {
                        ESP_LOGW(TAG, "WX field %d: stored sensor channel %u no longer exists, left unmapped", i, idx);
                        idx = SENSOR_LOCAL_CH_NONE;
                    }
                    c->wx_sensor_ch[i] = (uint8_t)idx;
                }
            }
        }
    }

