hiperiondev/esp32idf_APRS/main/app_config.c
    // Telemetry configuration (channel 0/1, Binary B1-B8 mapping) is no
    // longer part of config.json - loaded separately via
    // telemetry_config_load() from /storage/telemetry.json. Any leftover
    // tlm0*/tlm1*/tlmBit* keys in an old config.json are simply ignored here
    // (config_from_json() already ignores unknown keys generally).

    set_str(c->http_username, sizeof(c->http_username), jget_str(d, "httpUser", def.http_username));
    set_str(c->http_password, sizeof(c->http_password), jget_str(d, "httpPass", def.http_password));
    {
        cJSON *p = cJSON_GetObjectItemCaseSensitive(d, "path");
        for (int i = 0; i < 4; i++) {
            cJSON *v = p ? cJSON_GetArrayItem(p, i) : NULL;
            set_str(c->path[i], sizeof(c->path[i]), (v && cJSON_IsString(v)) ? v->valuestring : def.path[i]);
        }
    }

    // rfPTT (PTT GPIO) and rfPTTAct (PTT active-high) are not read back:
    // a config.json may still contain either key, but config_from_json()
    // ignores unknown keys, so both are simply skipped - the values come
    // from MODEM_PTT_GPIO / MODEM_PTT_ACTIVE_HIGH instead.

    if (!cJSON_GetObjectItemCaseSensitive(d, "msgEnable")) {
        // old-version file compatibility -> keep documented defaults
        c->msg_enable = true;
        c->msg_rf = true;
        c->msg_inet = true;
        c->msg_retry = 3;
        c->msg_interval = 30;
        c->msg_path = 9;
        set_str(c->msg_mycall, sizeof(c->msg_mycall), "NOCALL");
    } else {
        c->msg_enable = jget_bool(d, "msgEnable", def.msg_enable);
        c->msg_path = (uint8_t)jget_num(d, "msgPath", def.msg_path);
        c->msg_rf = jget_bool(d, "msgRf", def.msg_rf);
        c->msg_inet = jget_bool(d, "msgInet", def.msg_inet);
        c->msg_retry = (uint8_t)jget_num(d, "msgRetry", def.msg_retry);
        c->msg_interval = (uint16_t)jget_num(d, "msgInterval", def.msg_interval);
        set_str(c->msg_mycall, sizeof(c->msg_mycall), jget_str(d, "msgMycall", def.msg_mycall));
        c->msg_use_station = jget_bool(d, "msgUseStation", def.msg_use_station);
    }
    c->msg_alarm_enable = jget_bool(d, "msgAlarmEn", def.msg_alarm_enable);
    c->msg_alarm_gpio = (int8_t)jget_num(d, "msgAlarmGpio", def.msg_alarm_gpio);
    {
        cJSON *g = cJSON_GetObjectItemCaseSensitive(d, "msgGroup");
        for (int i = 0; i < 3; i++) {
            cJSON *v = g ? cJSON_GetArrayItem(g, i) : NULL;
            set_str(c->msg_group[i], sizeof(c->msg_group[i]), (v && cJSON_IsString(v)) ? v->valuestring : def.msg_group[i]);
        }
    }

    c->query_en = jget_bool(d, "queryEn", def.query_en);
    c->query_rf = jget_bool(d, "queryRf", def.query_rf);
    c->query_inet = jget_bool(d, "queryInet", def.query_inet);
    c->query_aprs_en = jget_bool(d, "queryAprsEn", def.query_aprs_en);
    c->query_wx_en = jget_bool(d, "queryWxEn", def.query_wx_en);
    c->query_igate_en = jget_bool(d, "queryIgateEn", def.query_igate_en);
    c->query_directed_en = jget_bool(d, "queryDirectedEn", def.query_directed_en);
    c->query_ext_en = jget_bool(d, "queryExtEn", def.query_ext_en);
    c->query_min_interval_sec = (uint16_t)jget_num(d, "queryMinInterval", def.query_min_interval_sec);
    if (c->query_min_interval_sec < 5) // floor: airtime/loop safety, matches the webconfig page's own clamp
        c->query_min_interval_sec = 5;
}

bool app_config_save(void) {
    // Streams the configuration straight to the file, one field at a time -
    // see the note on the JSON writer above for why no in-RAM document is
    // built.
    //
    // Serialize the whole save against any other save/load in flight (see
    // s_config_mutex comment above). Block indefinitely: a save must never
    // be silently dropped, and the critical section below is short.
    //
    // The handle is taken once and reused for the rest of the function, so the
    // stream handed out by json_store_open_tmp() is checked against the very
    // mutex this task holds.
    SemaphoreHandle_t lock = config_mutex();
    if (!lock) {
        ESP_LOGE(TAG, "save mutex unavailable (out of memory), configuration not written");
        return false;
    }
    xSemaphoreTake(lock, portMAX_DELAY);

    // Second, filesystem-wide gate (storage.h): config_mutex() only keeps two
    // config saves apart, while the temp-file + rename sequence below must
    // also not overlap the whole-partition erase the web Storage page can
    // trigger, nor a save being made by another subsystem. Module lock first,
    // this gate second - the order storage.h's contract requires.
    storage_write_lock();

    // The save mutex is held across this whole function, which is what
    // json_store_open_tmp() asserts before handing back a stream whose stdio
    // buffer is already pinned.
    FILE *f = json_store_open_tmp(CONFIG_TMP_PATH, TAG, lock);
    if (!f) {
        storage_write_unlock();
        xSemaphoreGive(lock);
        return false;
    }

    jw_t w = { .f = f, .obj_comma = false, .arr_comma = false };
    config_write_json(&w, &g_config);

    if (!json_store_commit(f, CONFIG_TMP_PATH, CONFIG_PATH, TAG, "configuration")) {
        storage_write_unlock();
        xSemaphoreGive(lock);
        return false;
    }

    // How close the calling task (normally the httpd task) came to overflowing
    // its stack during this save, so the config.stack_size in web_server.c can
    // be sized from real numbers instead of a guess. Remove once a safe margin
    // is confirmed.
    ESP_LOGI(TAG, "Caller stack high-water mark: %u bytes free", (unsigned)(uxTaskGetStackHighWaterMark(NULL) * sizeof(StackType_t)));
    storage_write_unlock();
    xSemaphoreGive(lock);
    return true;
}

bool app_config_load(void) {
    cJSON *doc = NULL;
    json_store_status_t st = json_store_read(CONFIG_PATH, TAG, "configuration", &doc);

    switch (st) {
        case JSON_STORE_OK:
            break;

        case JSON_STORE_OOM:
            // The file is very probably intact - there was simply no RAM to
            // read it into. Leave it exactly as it is and report the failure,
            // rather than writing defaults over a configuration that a later
            // attempt would have loaded fine.
            return false;

        case JSON_STORE_MISSING:
        case JSON_STORE_EMPTY:
        case JSON_STORE_CORRUPT:
        default:
            // The boot configuration is the one file the device cannot come up
            // without, so anything unusable here is replaced with the factory
            // set and written back immediately. That costs an operator a
            // corrupt config.json they might have wanted to inspect, and buys
            // a station that always boots into a reachable web admin instead
            // of one that needs a serial flash to recover.
            ESP_LOGW(TAG, "%s unusable, writing defaults", CONFIG_PATH);
            app_config_set_defaults(&g_config);
            return app_config_save();
    }

    config_from_json(doc, &g_config);
    cJSON_Delete(doc);
    ESP_LOGI(TAG, "Configuration loaded");
    return true;
}

bool app_config_factory_reset(void) {
    // Web-reachable (/default) at runtime, so it rewrites the whole g_config
    // out from under the beacon/igate/message tasks. Hold the data lock across
    // the wholesale rewrite so no reader can sample a half-reset struct; drop
    // it before the (slow, self-locking) flash save.
    app_config_lock();
    app_config_set_defaults(&g_config);
    app_config_unlock();
    return app_config_save();
}

